var p = {
    '1' : '北京市',
    '2' : '江西省',
    '3' : '河北省',
    '4' : '陕西省',
    '5' : '贵州省',
    '6' : '黑龙江省',
    '7' : '浙江省',
    '8' : '云南省',
    '9' : '四川省',
    '10' : '河南省',
    '11' : '山东省',
    '12' : '广西壮族自治区',
    '13' : '内蒙古自治区',
    '14' : '广东省',
    '15' : '海南省',
    '16' : '青海省',
    '17' : '江苏省',
    '18' : '湖北省',
    '19' : '上海市',
    '20' : '宁夏回族自治区',
    '21' : '重庆市',
    '22' : '甘肃省',
    '23' : '福建省',
    '24' : '辽宁省',
    '25' : '山西省',
    '26' : '吉林省',
    '27' : '天津市',
    '28' : '湖南省',
    '29' : '安徽省',
    '30' : '新疆维吾尔自治区',
    '31' : '台湾省',
    '32' : '香港特别行政区',
    '33' : '澳门特别行政区',
    '34' : '西藏自治区'
};

var c = {
    "340" : {
        "name" : "定西市",
        "parent" : 22
    },
    "1" : {
        "name" : "北京市",
        "parent" : 1
    },
    "2" : {
        "name" : "广州市",
        "parent" : 14
    },
    "3" : {
        "name" : "上海市",
        "parent" : 19
    },
    "4" : {
        "name" : "重庆市",
        "parent" : 21
    },
    "5" : {
        "name" : "沈阳市",
        "parent" : 24
    },
    "6" : {
        "name" : "南京市",
        "parent" : 17
    },
    "7" : {
        "name" : "武汉市",
        "parent" : 18
    },
    "8" : {
        "name" : "成都市",
        "parent" : 9
    },
    "9" : {
        "name" : "西安市",
        "parent" : 4
    },
    "10" : {
        "name" : "邯郸市",
        "parent" : 3
    },
    "11" : {
        "name" : "石家庄市",
        "parent" : 3
    },
    "12" : {
        "name" : "保定市",
        "parent" : 3
    },
    "13" : {
        "name" : "张家口市",
        "parent" : 3
    },
    "14" : {
        "name" : "承德市",
        "parent" : 3
    },
    "15" : {
        "name" : "唐山市",
        "parent" : 3
    },
    "16" : {
        "name" : "廊坊市",
        "parent" : 3
    },
    "17" : {
        "name" : "沧州市",
        "parent" : 3
    },
    "18" : {
        "name" : "衡水市",
        "parent" : 3
    },
    "19" : {
        "name" : "邢台市",
        "parent" : 3
    },
    "20" : {
        "name" : "秦皇岛市",
        "parent" : 3
    },
    "21" : {
        "name" : "忻州市",
        "parent" : 25
    },
    "22" : {
        "name" : "太原市",
        "parent" : 25
    },
    "23" : {
        "name" : "大同市",
        "parent" : 25
    },
    "24" : {
        "name" : "阳泉市",
        "parent" : 25
    },
    "25" : {
        "name" : "吕梁市",
        "parent" : 25
    },
    "26" : {
        "name" : "长治市",
        "parent" : 25
    },
    "27" : {
        "name" : "晋城市",
        "parent" : 25
    },
    "28" : {
        "name" : "临汾市",
        "parent" : 25
    },
    "29" : {
        "name" : "晋中市",
        "parent" : 25
    },
    "30" : {
        "name" : "运城市",
        "parent" : 25
    },
    "31" : {
        "name" : "朔州市",
        "parent" : 25
    },
    "32" : {
        "name" : "商丘市",
        "parent" : 10
    },
    "33" : {
        "name" : "郑州市",
        "parent" : 10
    },
    "34" : {
        "name" : "安阳市",
        "parent" : 10
    },
    "35" : {
        "name" : "新乡市",
        "parent" : 10
    },
    "36" : {
        "name" : "许昌市",
        "parent" : 10
    },
    "37" : {
        "name" : "平顶山市",
        "parent" : 10
    },
    "38" : {
        "name" : "南阳市",
        "parent" : 10
    },
    "39" : {
        "name" : "开封市",
        "parent" : 10
    },
    "40" : {
        "name" : "洛阳市",
        "parent" : 10
    },
    "41" : {
        "name" : "焦作市",
        "parent" : 10
    },
    "42" : {
        "name" : "鹤壁市",
        "parent" : 10
    },
    "43" : {
        "name" : "濮阳市",
        "parent" : 10
    },
    "44" : {
        "name" : "三门峡市",
        "parent" : 10
    },
    "45" : {
        "name" : "信阳市",
        "parent" : 10
    },
    "46" : {
        "name" : "周口市",
        "parent" : 10
    },
    "47" : {
        "name" : "驻马店市",
        "parent" : 10
    },
    "48" : {
        "name" : "漯河市",
        "parent" : 10
    },
    "49" : {
        "name" : "铁岭市",
        "parent" : 24
    },
    "50" : {
        "name" : "大连市",
        "parent" : 24
    },
    "51" : {
        "name" : "鞍山市",
        "parent" : 24
    },
    "52" : {
        "name" : "抚顺市",
        "parent" : 24
    },
    "53" : {
        "name" : "本溪市",
        "parent" : 24
    },
    "54" : {
        "name" : "丹东市",
        "parent" : 24
    },
    "55" : {
        "name" : "锦州市",
        "parent" : 24
    },
    "56" : {
        "name" : "营口市",
        "parent" : 24
    },
    "57" : {
        "name" : "辽阳市",
        "parent" : 24
    },
    "58" : {
        "name" : "朝阳市",
        "parent" : 24
    },
    "59" : {
        "name" : "阜新市",
        "parent" : 24
    },
    "60" : {
        "name" : "葫芦岛市",
        "parent" : 24
    },
    "61" : {
        "name" : "盘锦市",
        "parent" : 24
    },
    "62" : {
        "name" : "长春市",
        "parent" : 26
    },
    "63" : {
        "name" : "吉林市",
        "parent" : 26
    },
    "64" : {
        "name" : "延边朝鲜族自治州",
        "parent" : 26
    },
    "65" : {
        "name" : "四平市",
        "parent" : 26
    },
    "66" : {
        "name" : "通化市",
        "parent" : 26
    },
    "67" : {
        "name" : "白城市",
        "parent" : 26
    },
    "68" : {
        "name" : "辽源市",
        "parent" : 26
    },
    "69" : {
        "name" : "白山市",
        "parent" : 26
    },
    "70" : {
        "name" : "松原市",
        "parent" : 26
    },
    "71" : {
        "name" : "哈尔滨市",
        "parent" : 6
    },
    "72" : {
        "name" : "齐齐哈尔市",
        "parent" : 6
    },
    "73" : {
        "name" : "牡丹江市",
        "parent" : 6
    },
    "74" : {
        "name" : "佳木斯市",
        "parent" : 6
    },
    "75" : {
        "name" : "绥化市",
        "parent" : 6
    },
    "76" : {
        "name" : "大兴安岭地区",
        "parent" : 6
    },
    "77" : {
        "name" : "鹤岗市",
        "parent" : 6
    },
    "78" : {
        "name" : "黑河市",
        "parent" : 6
    },
    "79" : {
        "name" : "大庆市",
        "parent" : 6
    },
    "80" : {
        "name" : "鸡西市",
        "parent" : 6
    },
    "81" : {
        "name" : "七台河市",
        "parent" : 6
    },
    "82" : {
        "name" : "双鸭山市",
        "parent" : 6
    },
    "83" : {
        "name" : "伊春市",
        "parent" : 6
    },
    "84" : {
        "name" : "呼和浩特市",
        "parent" : 13
    },
    "85" : {
        "name" : "阿拉善盟",
        "parent" : 13
    },
    "86" : {
        "name" : "包头市",
        "parent" : 13
    },
    "87" : {
        "name" : "赤峰市",
        "parent" : 13
    },
    "89" : {
        "name" : "鄂尔多斯市",
        "parent" : 13
    },
    "91" : {
        "name" : "呼伦贝尔市",
        "parent" : 13
    },
    "92" : {
        "name" : "乌兰察布市",
        "parent" : 13
    },
    "93" : {
        "name" : "巴彦淖尔市",
        "parent" : 13
    },
    "94" : {
        "name" : "通辽市",
        "parent" : 13
    },
    "95" : {
        "name" : "乌海市",
        "parent" : 13
    },
    "96" : {
        "name" : "兴安盟",
        "parent" : 13
    },
    "97" : {
        "name" : "锡林郭勒盟",
        "parent" : 13
    },
    "98" : {
        "name" : "无锡市",
        "parent" : 17
    },
    "99" : {
        "name" : "镇江市",
        "parent" : 17
    },
    "100" : {
        "name" : "苏州市",
        "parent" : 17
    },
    "101" : {
        "name" : "南通市",
        "parent" : 17
    },
    "102" : {
        "name" : "扬州市",
        "parent" : 17
    },
    "103" : {
        "name" : "盐城市",
        "parent" : 17
    },
    "104" : {
        "name" : "徐州市",
        "parent" : 17
    },
    "105" : {
        "name" : "淮安市",
        "parent" : 17
    },
    "106" : {
        "name" : "连云港市",
        "parent" : 17
    },
    "107" : {
        "name" : "常州市",
        "parent" : 17
    },
    "108" : {
        "name" : "宿迁市",
        "parent" : 17
    },
    "109" : {
        "name" : "泰州市",
        "parent" : 17
    },
    "110" : {
        "name" : "菏泽市",
        "parent" : 11
    },
    "111" : {
        "name" : "济南市",
        "parent" : 11
    },
    "112" : {
        "name" : "青岛市",
        "parent" : 11
    },
    "113" : {
        "name" : "淄博市",
        "parent" : 11
    },
    "114" : {
        "name" : "德州市",
        "parent" : 11
    },
    "115" : {
        "name" : "烟台市",
        "parent" : 11
    },
    "116" : {
        "name" : "潍坊市",
        "parent" : 11
    },
    "117" : {
        "name" : "济宁市",
        "parent" : 11
    },
    "118" : {
        "name" : "泰安市",
        "parent" : 11
    },
    "119" : {
        "name" : "临沂市",
        "parent" : 11
    },
    "120" : {
        "name" : "滨州市",
        "parent" : 11
    },
    "121" : {
        "name" : "东营市",
        "parent" : 11
    },
    "122" : {
        "name" : "莱芜市",
        "parent" : 11
    },
    "123" : {
        "name" : "聊城市",
        "parent" : 11
    },
    "124" : {
        "name" : "日照市",
        "parent" : 11
    },
    "125" : {
        "name" : "威海市",
        "parent" : 11
    },
    "126" : {
        "name" : "枣庄市",
        "parent" : 11
    },
    "127" : {
        "name" : "合肥市",
        "parent" : 29
    },
    "128" : {
        "name" : "蚌埠市",
        "parent" : 29
    },
    "129" : {
        "name" : "芜湖市",
        "parent" : 29
    },
    "130" : {
        "name" : "淮南市",
        "parent" : 29
    },
    "131" : {
        "name" : "马鞍山市",
        "parent" : 29
    },
    "132" : {
        "name" : "安庆市",
        "parent" : 29
    },
    "133" : {
        "name" : "宿州市",
        "parent" : 29
    },
    "134" : {
        "name" : "阜阳市",
        "parent" : 29
    },
    "135" : {
        "name" : "黄山市",
        "parent" : 29
    },
    "136" : {
        "name" : "亳州市",
        "parent" : 29
    },
    "137" : {
        "name" : "铜陵市",
        "parent" : 29
    },
    "138" : {
        "name" : "宣城市",
        "parent" : 29
    },
    "139" : {
        "name" : "六安市",
        "parent" : 29
    },
    "141" : {
        "name" : "滁州市",
        "parent" : 29
    },
    "142" : {
        "name" : "池州市",
        "parent" : 29
    },
    "143" : {
        "name" : "淮北市",
        "parent" : 29
    },
    "144" : {
        "name" : "杭州市",
        "parent" : 7
    },
    "145" : {
        "name" : "湖州市",
        "parent" : 7
    },
    "146" : {
        "name" : "嘉兴市",
        "parent" : 7
    },
    "147" : {
        "name" : "宁波市",
        "parent" : 7
    },
    "148" : {
        "name" : "衢州市",
        "parent" : 7
    },
    "149" : {
        "name" : "台州市",
        "parent" : 7
    },
    "150" : {
        "name" : "温州市",
        "parent" : 7
    },
    "151" : {
        "name" : "丽水市",
        "parent" : 7
    },
    "152" : {
        "name" : "金华市",
        "parent" : 7
    },
    "153" : {
        "name" : "舟山市",
        "parent" : 7
    },
    "154" : {
        "name" : "福州市",
        "parent" : 23
    },
    "155" : {
        "name" : "厦门市",
        "parent" : 23
    },
    "156" : {
        "name" : "宁德市",
        "parent" : 23
    },
    "157" : {
        "name" : "莆田市",
        "parent" : 23
    },
    "158" : {
        "name" : "泉州市",
        "parent" : 23
    },
    "159" : {
        "name" : "漳州市",
        "parent" : 23
    },
    "160" : {
        "name" : "龙岩市",
        "parent" : 23
    },
    "161" : {
        "name" : "三明市",
        "parent" : 23
    },
    "162" : {
        "name" : "南平市",
        "parent" : 23
    },
    "163" : {
        "name" : "揭阳市",
        "parent" : 14
    },
    "164" : {
        "name" : "鄂州市",
        "parent" : 18
    },
    "165" : {
        "name" : "孝感市",
        "parent" : 18
    },
    "166" : {
        "name" : "黄冈市",
        "parent" : 18
    },
    "167" : {
        "name" : "黄石市",
        "parent" : 18
    },
    "168" : {
        "name" : "咸宁市",
        "parent" : 18
    },
    "169" : {
        "name" : "荆州市",
        "parent" : 18
    },
    "170" : {
        "name" : "恩施土家族苗族自治州",
        "parent" : 18
    },
    "171" : {
        "name" : "随州市",
        "parent" : 18
    },
    "172" : {
        "name" : "十堰市",
        "parent" : 18
    },
    "173" : {
        "name" : "襄阳市",
        "parent" : 18
    },
    "174" : {
        "name" : "荆门市",
        "parent" : 18
    },
    "175" : {
        "name" : "宜昌市",
        "parent" : 18
    },
    "176" : {
        "name" : "岳阳市",
        "parent" : 28
    },
    "177" : {
        "name" : "长沙市",
        "parent" : 28
    },
    "178" : {
        "name" : "湘潭市",
        "parent" : 28
    },
    "179" : {
        "name" : "株洲市",
        "parent" : 28
    },
    "180" : {
        "name" : "衡阳市",
        "parent" : 28
    },
    "181" : {
        "name" : "郴州市",
        "parent" : 28
    },
    "182" : {
        "name" : "常德市",
        "parent" : 28
    },
    "183" : {
        "name" : "益阳市",
        "parent" : 28
    },
    "184" : {
        "name" : "怀化市",
        "parent" : 28
    },
    "185" : {
        "name" : "邵阳市",
        "parent" : 28
    },
    "186" : {
        "name" : "湘西土家族苗族自治州",
        "parent" : 28
    },
    "187" : {
        "name" : "娄底市",
        "parent" : 28
    },
    "188" : {
        "name" : "永州市",
        "parent" : 28
    },
    "189" : {
        "name" : "张家界市",
        "parent" : 28
    },
    "190" : {
        "name" : "江门市",
        "parent" : 14
    },
    "191" : {
        "name" : "韶关市",
        "parent" : 14
    },
    "192" : {
        "name" : "惠州市",
        "parent" : 14
    },
    "193" : {
        "name" : "梅州市",
        "parent" : 14
    },
    "194" : {
        "name" : "汕头市",
        "parent" : 14
    },
    "195" : {
        "name" : "深圳市",
        "parent" : 14
    },
    "196" : {
        "name" : "珠海市",
        "parent" : 14
    },
    "197" : {
        "name" : "佛山市",
        "parent" : 14
    },
    "198" : {
        "name" : "肇庆市",
        "parent" : 14
    },
    "199" : {
        "name" : "湛江市",
        "parent" : 14
    },
    "200" : {
        "name" : "中山市",
        "parent" : 14
    },
    "201" : {
        "name" : "河源市",
        "parent" : 14
    },
    "202" : {
        "name" : "茂名市",
        "parent" : 14
    },
    "203" : {
        "name" : "汕尾市",
        "parent" : 14
    },
    "204" : {
        "name" : "云浮市",
        "parent" : 14
    },
    "205" : {
        "name" : "清远市",
        "parent" : 14
    },
    "206" : {
        "name" : "阳江市",
        "parent" : 14
    },
    "207" : {
        "name" : "潮州市",
        "parent" : 14
    },
    "208" : {
        "name" : "东莞市",
        "parent" : 14
    },
    "209" : {
        "name" : "南宁市",
        "parent" : 12
    },
    "210" : {
        "name" : "柳州市",
        "parent" : 12
    },
    "211" : {
        "name" : "桂林市",
        "parent" : 12
    },
    "212" : {
        "name" : "梧州市",
        "parent" : 12
    },
    "213" : {
        "name" : "北海市",
        "parent" : 12
    },
    "214" : {
        "name" : "百色市",
        "parent" : 12
    },
    "215" : {
        "name" : "防城港市",
        "parent" : 12
    },
    "216" : {
        "name" : "贵港市",
        "parent" : 12
    },
    "217" : {
        "name" : "河池市",
        "parent" : 12
    },
    "218" : {
        "name" : "贺州市",
        "parent" : 12
    },
    "219" : {
        "name" : "钦州市",
        "parent" : 12
    },
    "220" : {
        "name" : "玉林市",
        "parent" : 12
    },
    "221" : {
        "name" : "抚州市",
        "parent" : 2
    },
    "222" : {
        "name" : "新余市",
        "parent" : 2
    },
    "223" : {
        "name" : "南昌市",
        "parent" : 2
    },
    "224" : {
        "name" : "九江市",
        "parent" : 2
    },
    "225" : {
        "name" : "上饶市",
        "parent" : 2
    },
    "226" : {
        "name" : "鹰潭市",
        "parent" : 2
    },
    "227" : {
        "name" : "宜春市",
        "parent" : 2
    },
    "228" : {
        "name" : "吉安市",
        "parent" : 2
    },
    "229" : {
        "name" : "赣州市",
        "parent" : 2
    },
    "230" : {
        "name" : "景德镇市",
        "parent" : 2
    },
    "231" : {
        "name" : "萍乡市",
        "parent" : 2
    },
    "232" : {
        "name" : "攀枝花市",
        "parent" : 9
    },
    "233" : {
        "name" : "自贡市",
        "parent" : 9
    },
    "234" : {
        "name" : "绵阳市",
        "parent" : 9
    },
    "235" : {
        "name" : "达州市",
        "parent" : 9
    },
    "236" : {
        "name" : "巴中市",
        "parent" : 9
    },
    "237" : {
        "name" : "南充市",
        "parent" : 9
    },
    "238" : {
        "name" : "遂宁市",
        "parent" : 9
    },
    "239" : {
        "name" : "雅安市",
        "parent" : 9
    },
    "240" : {
        "name" : "资阳市",
        "parent" : 9
    },
    "241" : {
        "name" : "宜宾市",
        "parent" : 9
    },
    "242" : {
        "name" : "内江市",
        "parent" : 9
    },
    "243" : {
        "name" : "乐山市",
        "parent" : 9
    },
    "244" : {
        "name" : "凉山彝族自治州",
        "parent" : 9
    },
    "245" : {
        "name" : "阿坝藏族羌族自治州",
        "parent" : 9
    },
    "246" : {
        "name" : "德阳市",
        "parent" : 9
    },
    "247" : {
        "name" : "甘孜藏族自治州",
        "parent" : 9
    },
    "248" : {
        "name" : "广安市",
        "parent" : 9
    },
    "249" : {
        "name" : "广元市",
        "parent" : 9
    },
    "250" : {
        "name" : "泸州市",
        "parent" : 9
    },
    "251" : {
        "name" : "眉山市",
        "parent" : 9
    },
    "252" : {
        "name" : "贵阳市",
        "parent" : 5
    },
    "253" : {
        "name" : "遵义市",
        "parent" : 5
    },
    "254" : {
        "name" : "安顺市",
        "parent" : 5
    },
    "255" : {
        "name" : "黔南布依族苗族自治州",
        "parent" : 5
    },
    "256" : {
        "name" : "黔东南苗族侗族自治州",
        "parent" : 5
    },
    "257" : {
        "name" : "铜仁市",
        "parent" : 5
    },
    "258" : {
        "name" : "毕节市",
        "parent" : 5
    },
    "259" : {
        "name" : "六盘水市",
        "parent" : 5
    },
    "260" : {
        "name" : "黔西南布依族苗族自治州",
        "parent" : 5
    },
    "261" : {
        "name" : "丽江市",
        "parent" : 8
    },
    "262" : {
        "name" : "昆明市",
        "parent" : 8
    },
    "263" : {
        "name" : "大理白族自治州",
        "parent" : 8
    },
    "264" : {
        "name" : "德宏傣族景颇族自治州",
        "parent" : 8
    },
    "265" : {
        "name" : "曲靖市",
        "parent" : 8
    },
    "266" : {
        "name" : "保山市",
        "parent" : 8
    },
    "267" : {
        "name" : "迪庆藏族自治州",
        "parent" : 8
    },
    "268" : {
        "name" : "红河哈尼族彝族自治州",
        "parent" : 8
    },
    "269" : {
        "name" : "楚雄彝族自治州",
        "parent" : 8
    },
    "270" : {
        "name" : "普洱市",
        "parent" : 8
    },
    "271" : {
        "name" : "临沧市",
        "parent" : 8
    },
    "272" : {
        "name" : "怒江傈僳族自治州",
        "parent" : 8
    },
    "273" : {
        "name" : "文山壮族苗族自治州",
        "parent" : 8
    },
    "274" : {
        "name" : "西双版纳傣族自治州",
        "parent" : 8
    },
    "275" : {
        "name" : "玉溪市",
        "parent" : 8
    },
    "276" : {
        "name" : "昭通市",
        "parent" : 8
    },
    "277" : {
        "name" : "海口市",
        "parent" : 15
    },
    "278" : {
        "name" : "三亚市",
        "parent" : 15
    },
    "279" : {
        "name" : "咸阳市",
        "parent" : 4
    },
    "280" : {
        "name" : "延安市",
        "parent" : 4
    },
    "281" : {
        "name" : "榆林市",
        "parent" : 4
    },
    "282" : {
        "name" : "渭南市",

        "parent" : 4
    },
    "283" : {
        "name" : "商洛市",
        "parent" : 4
    },
    "284" : {
        "name" : "安康市",
        "parent" : 4
    },
    "285" : {
        "name" : "汉中市",
        "parent" : 4
    },
    "286" : {
        "name" : "宝鸡市",
        "parent" : 4
    },
    "287" : {
        "name" : "铜川市",
        "parent" : 4
    },
    "288" : {
        "name" : "兰州市",
        "parent" : 22
    },
    "289" : {
        "name" : "平凉市",
        "parent" : 22
    },
    "290" : {
        "name" : "庆阳市",
        "parent" : 22
    },
    "292" : {
        "name" : "白银市",
        "parent" : 22
    },
    "293" : {
        "name" : "酒泉市",
        "parent" : 22
    },
    "294" : {
        "name" : "天水市",
        "parent" : 22
    },
    "295" : {
        "name" : "甘南藏族自治州",
        "parent" : 22
    },
    "296" : {
        "name" : "嘉峪关市",
        "parent" : 22
    },
    "297" : {
        "name" : "金昌市",
        "parent" : 22
    },
    "298" : {
        "name" : "临夏回族自治州",
        "parent" : 22
    },
    "299" : {
        "name" : "陇南市",
        "parent" : 22
    },
    "300" : {
        "name" : "武威市",
        "parent" : 22
    },
    "301" : {
        "name" : "张掖市",
        "parent" : 22
    },
    "302" : {
        "name" : "银川市",
        "parent" : 20
    },
    "303" : {
        "name" : "固原市",
        "parent" : 20
    },
    "304" : {
        "name" : "石嘴山市",
        "parent" : 20
    },
    "305" : {
        "name" : "吴忠市",
        "parent" : 20
    },
    "306" : {
        "name" : "西宁市",
        "parent" : 16
    },
    "307" : {
        "name" : "海西蒙古族藏族自治州",
        "parent" : 16
    },
    "308" : {
        "name" : "果洛藏族自治州",
        "parent" : 16
    },
    "309" : {
        "name" : "海北藏族自治州",
        "parent" : 16
    },
    "310" : {
        "name" : "海东地区",
        "parent" : 16
    },
    "311" : {
        "name" : "黄南藏族自治州",
        "parent" : 16
    },
    "312" : {
        "name" : "玉树藏族自治州",
        "parent" : 16
    },
    "313" : {
        "name" : "伊犁哈萨克自治州",
        "parent" : 30
    },
    "315" : {
        "name" : "吐鲁番地区",
        "parent" : 30
    },
    "316" : {
        "name" : "塔城地区",
        "parent" : 30
    },
    "318" : {
        "name" : "巴音郭楞蒙古自治州",
        "parent" : 30
    },
    "319" : {
        "name" : "克拉玛依市",
        "parent" : 30
    },
    "320" : {
        "name" : "乌鲁木齐市",
        "parent" : 30
    },
    "321" : {
        "name" : "阿克苏地区",
        "parent" : 30
    },
    "322" : {
        "name" : "阿勒泰地区",
        "parent" : 30
    },
    "323" : {
        "name" : "克孜勒苏柯尔克孜自治州",
        "parent" : 30
    },
    "324" : {
        "name" : "博尔塔拉蒙古自治州",
        "parent" : 30
    },
    "325" : {
        "name" : "昌吉回族自治州",
        "parent" : 30
    },
    "326" : {
        "name" : "哈密地区",
        "parent" : 30
    },
    "327" : {
        "name" : "和田地区",
        "parent" : 30
    },
    "328" : {
        "name" : "喀什地区",
        "parent" : 30
    },
    "329" : {
        "name" : "绍兴市",
        "parent" : 7
    },
    "331" : {
        "name" : "天津市",
        "parent" : 27
    },
    "332" : {
        "name" : "拉萨市",
        "parent" : 34
    },
    "333" : {
        "name" : "香港特别行政区",
        "parent" : 32
    },
    "334" : {
        "name" : "澳门特别行政区",
        "parent" : 33
    },
    "335" : {
        "name" : "台北",
        "parent" : 31
    },
    "336" : {
        "name" : "台中",
        "parent" : 31
    },
    "337" : {
        "name" : "台南",
        "parent" : 31
    },
    "338" : {
        "name" : "高雄",
        "parent" : 31
    },
    "339" : {
        "name" : "花莲",
        "parent" : 31
    },
    "354" : {
        "name" : "省直辖县级行政区划",
        "parent" : 15
    },
    "342" : {
        "name" : "来宾市",
        "parent" : 12
    },
    "343" : {
        "name" : "崇左市",
        "parent" : 12
    },
    "344" : {
        "name" : "昌都地区",
        "parent" : 34
    },
    "345" : {
        "name" : "山南地区",
        "parent" : 34
    },
    "346" : {
        "name" : "日喀则地区",
        "parent" : 34
    },
    "347" : {
        "name" : "那曲地区",
        "parent" : 34
    },
    "348" : {
        "name" : "阿里地区",
        "parent" : 34
    },
    "349" : {
        "name" : "林芝地区",
        "parent" : 34
    },
    "350" : {
        "name" : "海南藏族自治州",
        "parent" : 16
    },
    "351" : {
        "name" : "中卫市",
        "parent" : 20
    }
};