var excel = [
    {
        "pId": 1, 
        "pName": "新疆", 
        "Cities": [
            {
                "cId": 1, 
                "cName": "阿克苏", 
                "Dealers": [
                    "阿克苏振宇汽车销售有限责任公司"
                ]
            }, 
            {
                "cId": 8, 
                "cName": "昌吉", 
                "Dealers": [
                    "昌吉市庞大一众汽车销售服务有限公司"
                ]
            }, 
            {
                "cId": 23, 
                "cName": "哈密", 
                "Dealers": [
                    "哈密庞大一众汽车销售服务有限公司"
                ]
            }, 
            {
                "cId": 31, 
                "cName": "喀什", 
                "Dealers": [
                    "喀什庞大一众汽车销售服务有限公司"
                ]
            }, 
            {
                "cId": 33, 
                "cName": "克拉玛依", 
                "Dealers": [
                    "克拉玛依庞大一种汽车销售服务有限公司"
                ]
            }, 
            {
                "cId": 34, 
                "cName": "库尔勒", 
                "Dealers": [
                    "库尔勒庞大一众汽车销售服务有限公司"
                ]
            }, 
            {
                "cId": 61, 
                "cName": "乌鲁木齐", 
                "Dealers": [
                    "新疆汇捷汽车销售服务有限责任公司", 
                    "新疆天汇华宇汽车销售服务有限责任公司", 
                    "新疆庞大一众汽车销售服务有限公司", 
                    "乌鲁木齐庞大腾众汽车销售有限公司"
                ]
            }
        ]
    }, 
    {
        "pId": 2, 
        "pName": "陕西", 
        "Cities": [
            {
                "cId": 2, 
                "cName": "安康", 
                "Dealers": [
                    "安康市庞大一众汽车销售有限公司"
                ]
            }, 
            {
                "cId": 6, 
                "cName": "宝鸡", 
                "Dealers": [
                    "宝鸡市宝众汽车销售服务有限责任公司"
                ]
            }, 
            {
                "cId": 16, 
                "cName": "府谷县", 
                "Dealers": [
                    "府谷恒捷汽贸有限公司"
                ]
            }, 
            {
                "cId": 24, 
                "cName": "韩城", 
                "Dealers": [
                    "韩城众瑞汽车销售有限责任公司"
                ]
            }, 
            {
                "cId": 25, 
                "cName": "汉中", 
                "Dealers": [
                    "陕西汉中博通汽车销售服务有限公司"
                ]
            }, 
            {
                "cId": 29, 
                "cName": "靖边", 
                "Dealers": [
                    "靖边县恒博汽贸有限公司"
                ]
            }, 
            {
                "cId": 52, 
                "cName": "延安", 
                "Dealers": [
                    "延安市宝塔区黄泰有限责任公司"
                ]
            }, 
            {
                "cId": 53, 
                "cName": "神木", 
                "Dealers": [
                    "神木县恒捷汽贸有限公司"
                ]
            }, 
            {
                "cId": 56, 
                "cName": "铜川新区", 
                "Dealers": [
                    "铜川新区黄泰汽车销售服务有限责任公司"
                ]
            }, 
            {
                "cId": 59, 
                "cName": "渭南", 
                "Dealers": [
                    "渭南佳燕汽车贸易有限公司"
                ]
            }, 
            {
                "cId": 63, 
                "cName": "西安", 
                "Dealers": [
                    "西安秦川唐都机电汽车配件销售有限公司", 
                    "陕西鹰之杰汽车贸易有限公司", 
                    "陕西东明汽车商行有限公司", 
                    "陕西天一汽车销售服务有限责任公司", 
                    "西安新白云汽车销售服务有限公司", 
                    "陕西尊荣致诚汽车贸易有限公司（即将开业）", 
                    "陕西百佳汽车贸易有限公司"
                ]
            }, 
            {
                "cId": 65, 
                "cName": "咸阳", 
                "Dealers": [
                    "咸阳恒丰汽贸有限公司"
                ]
            }, 
            {
                "cId": 69, 
                "cName": "榆林", 
                "Dealers": [
                    "榆林市恒源汽贸有限公司", 
                    "榆林恒丰汽贸有限公司"
                ]
            }
        ]
    }, 
    {
        "pId": 3, 
        "pName": "云南", 
        "Cities": [
            {
                "cId": 3, 
                "cName": "安宁", 
                "Dealers": [
                    "安宁谊众汽车销售有限公司"
                ]
            }, 
            {
                "cId": 7, 
                "cName": "保山", 
                "Dealers": [
                    "保山联通汽车销售维修有限责任公司"
                ]
            }, 
            {
                "cId": 10, 
                "cName": "楚雄", 
                "Dealers": [
                    "楚雄易通汽车销售服务有限公司"
                ]
            }, 
            {
                "cId": 12, 
                "cName": "大理", 
                "Dealers": [
                    "大理阿鹏有限责任公司"
                ]
            }, 
            {
                "cId": 28, 
                "cName": "景洪市", 
                "Dealers": [
                    "西双版纳捷成通达汽车销售有限公司"
                ]
            }, 
            {
                "cId": 32, 
                "cName": "开远", 
                "Dealers": [
                    "红河州鸿云汽车经贸有限公司"
                ]
            }, 
            {
                "cId": 35, 
                "cName": "昆明", 
                "Dealers": [
                    "云南云汽汽车销售服务有限公司", 
                    "云南一汽工贸汽车销售服务有限公司", 
                    "云南金鼎汽车贸易有限公司", 
                    "昆明谊众汽车销售有限公司", 
                    "昆明捷通达汽车销售有限公司"
                ]
            }, 
            {
                "cId": 39, 
                "cName": "丽江", 
                "Dealers": [
                    "丽江恒盛通达汽车销售有限公司"
                ]
            }, 
            {
                "cId": 43, 
                "cName": "蒙自", 
                "Dealers": [
                    "红河州捷鸿汽车经贸有限公司"
                ]
            }, 
            {
                "cId": 50, 
                "cName": "曲靖", 
                "Dealers": [
                    "云南曲靖云鑫工贸有限公司", 
                    "曲靖宝捷汽车销售有限公司"
                ]
            }, 
            {
                "cId": 60, 
                "cName": "文山", 
                "Dealers": [
                    "文山捷惠汽车销售服务有限公司"
                ]
            }, 
            {
                "cId": 67, 
                "cName": "宣威", 
                "Dealers": [
                    "宣威市添福源汽车贸易有限公司"
                ]
            }, 
            {
                "cId": 70, 
                "cName": "玉溪", 
                "Dealers": [
                    "玉溪驰瑞汽车销售服务有限公司"
                ]
            }, 
            {
                "cId": 71, 
                "cName": "云南", 
                "Dealers": [
                    "德宏龙泰通达汽车销售有限公司"
                ]
            }, 
            {
                "cId": 72, 
                "cName": "昭通", 
                "Dealers": [
                    "昭通市恒升汽车服务有限公司"
                ]
            }
        ]
    }, 
    {
        "pId": 4, 
        "pName": "贵州", 
        "Cities": [
            {
                "cId": 4, 
                "cName": "安顺", 
                "Dealers": [
                    "安顺恒信众联汽车销售服务有限公司"
                ]
            }, 
            {
                "cId": 15, 
                "cName": "都匀", 
                "Dealers": [
                    "都匀恒信众联汽车销售服务有限公司"
                ]
            }, 
            {
                "cId": 21, 
                "cName": "贵阳", 
                "Dealers": [
                    "贵州利和汽车贸易有限公司", 
                    "贵州四扬汽车销售服务有限公司", 
                    "贵州汽车修理公司"
                ]
            }, 
            {
                "cId": 22, 
                "cName": "凯里", 
                "Dealers": [
                    "凯里恒信众联汽车销售服务有限公司"
                ]
            }, 
            {
                "cId": 40, 
                "cName": "六盘水", 
                "Dealers": [
                    "六盘水和通汽车销售服务有限公司"
                ]
            }, 
            {
                "cId": 57, 
                "cName": "铜仁", 
                "Dealers": [
                    "铜仁恒信众联汽车销售服务有限公司"
                ]
            }, 
            {
                "cId": 66, 
                "cName": "兴义", 
                "Dealers": [
                    "兴义市恒信众联汽车销售服务有限公司"
                ]
            }, 
            {
                "cId": 75, 
                "cName": "遵义", 
                "Dealers": [
                    "遵义华来金汽车贸易有限公司", 
                    "遵义市千汇汽车销售服务有限公司"
                ]
            }
        ]
    }, 
    {
        "pId": 5, 
        "pName": "西北", 
        "Cities": [
            {
                "cId": 5, 
                "cName": "白银", 
                "Dealers": [
                    "白银庞大一众汽车销售服务有限公司"
                ]
            }, 
            {
                "cId": 17, 
                "cName": "甘肃", 
                "Dealers": [
                    "兰州金岛汽车销售有限公司"
                ]
            }, 
            {
                "cId": 18, 
                "cName": "格尔木", 
                "Dealers": [
                    "格尔木宝瑞通汽车贸易有限公司"
                ]
            }, 
            {
                "cId": 26, 
                "cName": "嘉峪关", 
                "Dealers": [
                    "甘肃友好汽车服务有限责任公司"
                ]
            }, 
            {
                "cId": 27, 
                "cName": "金昌", 
                "Dealers": [
                    "金昌赛亚汇通汽车销售服务有限公司"
                ]
            }, 
            {
                "cId": 30, 
                "cName": "酒泉", 
                "Dealers": [
                    "酒泉金岛汽车销售服务有限公司"
                ]
            }, 
            {
                "cId": 36, 
                "cName": "拉萨", 
                "Dealers": [
                    "拉萨康达汽贸有限责任公司"
                ]
            }, 
            {
                "cId": 37, 
                "cName": "兰州", 
                "Dealers": [
                    "兰州庞大一众汽车销售服务有限公司", 
                    "兰州新纪元汽车销售服务有限公司", 
                    "兰州金盛强汽车销售有限公司"
                ]
            }, 
            {
                "cId": 48, 
                "cName": "平凉", 
                "Dealers": [
                    "平凉润之杰汽车销售服务有限公司"
                ]
            }, 
            {
                "cId": 54, 
                "cName": "石嘴山", 
                "Dealers": [
                    "石嘴山市朗宁汽车销售有限责任公司"
                ]
            }, 
            {
                "cId": 62, 
                "cName": "吴忠", 
                "Dealers": [
                    "吴忠市润众汽车销售服务有限公司"
                ]
            }, 
            {
                "cId": 64, 
                "cName": "西宁", 
                "Dealers": [
                    "青海海通汽车贸易有限公司", 
                    "青海通瑞汽车贸易有限公司"
                ]
            }, 
            {
                "cId": 68, 
                "cName": "银川", 
                "Dealers": [
                    "宁夏润众汽车销售服务有限公司", 
                    "宁夏润之杰汽车销售服务有限责任公司", 
                    "宁夏润之星汽车销售服务有限公司"
                ]
            }
        ]
    }, 
    {
        "pId": 6, 
        "pName": "成都", 
        "Cities": [
            {
                "cId": 9, 
                "cName": "成都", 
                "Dealers": [
                    "成都曙光汽车销售服务有限公司", 
                    "四川一汽贸易有限责任公司", 
                    "成都运通博恩汽车销售有限公司", 
                    "成都启阳远航汽车销售服务有限公司", 
                    "成都宏羽众信汽车服务有限责任公司", 
                    "成都汇和汽车销售有限公司", 
                    "四川申蓉雅泰汽车销售服务有限公司", 
                    "成都启新汽车服务有限责任公司", 
                    "成都市强生实业有限责任公司", 
                    "四川长征汽车贸易有限公司", 
                    "四川华星大众汽车销售服务有限公司", 
                    "成都精典吉众汽车销售服务有限公司", 
                    "东创建国汽车集团成都天弘车业有限公司", 
                    "四川申蓉和浩汽车销售服务有限公司", 
                    "成都广汇申蓉汇通汽车销售服务有限公司", 
                    "成都浩龙汽车销售服务有限公司", 
                    "崇州瑞龙汽车销售服务有限公司"
                ]
            }, 
            {
                "cId": 14, 
                "cName": "都江堰", 
                "Dealers": [
                    "都江堰阔龙汽车销售服务有限公司"
                ]
            }, 
            {
                "cId": 49, 
                "cName": "蒲江", 
                "Dealers": [
                    "成都汇腾汽车销售服务有限公司"
                ]
            }
        ]
    }, 
    {
        "pId": 7, 
        "pName": "川北", 
        "Cities": [
            {
                "cId": 11, 
                "cName": "达州", 
                "Dealers": [
                    "达州市新世纪汽车销售服务有限公司"
                ]
            }, 
            {
                "cId": 13, 
                "cName": "德阳", 
                "Dealers": [
                    "四川德阳川西汽车销售服务有限公司", 
                    "德阳万路众悦汽车销售服务有限公司", 
                    "德阳盛鸿汽车销售服务有限公司"
                ]
            }, 
            {
                "cId": 19, 
                "cName": "广汉", 
                "Dealers": [
                    "广汉恒达汽车销售服务有限公司"
                ]
            }, 
            {
                "cId": 20, 
                "cName": "广元", 
                "Dealers": [
                    "广元建雄汽车销售服务有限公司"
                ]
            }, 
            {
                "cId": 44, 
                "cName": "绵阳", 
                "Dealers": [
                    "绵阳市倍尔轿车服务有限公司", 
                    "绵阳景鸿汽车销售服务有限公司"
                ]
            }, 
            {
                "cId": 45, 
                "cName": "南充", 
                "Dealers": [
                    "南充明云惠民车业有限公司", 
                    "南充明云运行车业有限公司"
                ]
            }, 
            {
                "cId": 55, 
                "cName": "遂宁", 
                "Dealers": [
                    "遂宁市瑞胜汽车销售有限公司"
                ]
            }
        ]
    }, 
    {
        "pId": 8, 
        "pName": "川南", 
        "Cities": [
            {
                "cId": 38, 
                "cName": "乐山", 
                "Dealers": [
                    "乐山市华茂车业有限责任公司"
                ]
            }, 
            {
                "cId": 41, 
                "cName": "泸州", 
                "Dealers": [
                    "泸州松明汽贸有限公司"
                ]
            }, 
            {
                "cId": 42, 
                "cName": "眉山", 
                "Dealers": [
                    "四川省眉山市建国汽车有限公司"
                ]
            }, 
            {
                "cId": 46, 
                "cName": "内江", 
                "Dealers": [
                    "内江瑞龙汽车销售服务有限公司"
                ]
            }, 
            {
                "cId": 47, 
                "cName": "攀枝花", 
                "Dealers": [
                    "攀枝花市力行工贸有限责任公司"
                ]
            }, 
            {
                "cId": 51, 
                "cName": "仁寿", 
                "Dealers": [
                    "四川仁寿恒信汽车销售有限公司"
                ]
            }, 
            {
                "cId": 74, 
                "cName": "自贡", 
                "Dealers": [
                    "自贡市和众汽车销售服务有限公司"
                ]
            }
        ]
    }, 
    {
        "pId": 9, 
        "pName": "重庆", 
        "Cities": [
            {
                "cId": 58, 
                "cName": "万州", 
                "Dealers": [
                    "重庆百事达华博汽车销售服务有限公司"
                ]
            }, 
            {
                "cId": 73, 
                "cName": "重庆", 
                "Dealers": [
                    "重庆龙华实业集团众友汽车销售服务有限公司", 
                    "重庆商社汽车贸易有限公司", 
                    "重庆龙华实业集团众华汽车销售服务有限公司", 
                    "重庆龙华实业集团协众汽车销售服务有限公司", 
                    "重庆盛驰汽车有限公司", 
                    "重庆商社众志渝涵汽车销售有限公司", 
                    "重庆百事达华驰汽车销售服务有限公司"
                ]
            }
        ]
    }
]
